#Дан список чисел. Определите, сколько в нем
#встречается различных чисел.

i = list(input("Введите   "))
p = {*i}
o = len(p) #
print(o) #Print (len(p))
